# DirectShapeTypeOptions Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShapeTypeOptions Constructor
DirectShapeTypeOptions Class See Also
---
Constructs a new DirectShapeTypeOptions instance with default settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public DirectShapeTypeOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
DirectShapeTypeOptions()
```

# See Also
DirectShapeTypeOptions Class
Autodesk.Revit.DB Namespace